-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Sep 02, 2025 at 03:35 PM
-- Server version: 8.0.30
-- PHP Version: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `iranianshop`
--

-- --------------------------------------------------------

--
-- Table structure for table `cart`
--

CREATE TABLE `cart` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `quantity` int NOT NULL DEFAULT '1',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cities`
--

CREATE TABLE `cities` (
  `id` int NOT NULL,
  `province_id` int NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `cities`
--

INSERT INTO `cities` (`id`, `province_id`, `name`) VALUES
(1, 1, 'اردبیل'),
(2, 1, 'اصلاندوز'),
(3, 1, 'آبی بیگلو'),
(4, 1, 'بیله سوار'),
(5, 1, 'پارس آباد'),
(6, 1, 'تازه کند'),
(7, 1, 'تازه کندانگوت'),
(8, 1, 'جعفرآباد'),
(9, 1, 'خلخال'),
(10, 1, 'رضی'),
(11, 1, 'سرعین'),
(12, 1, 'عنبران'),
(13, 1, 'فخرآباد'),
(14, 1, 'کلور'),
(15, 1, 'کوراییم'),
(16, 1, 'گرمی'),
(17, 1, 'گیوی'),
(18, 1, 'لاهرود'),
(19, 1, 'مرادلو'),
(20, 1, 'مشگین شهر'),
(21, 1, 'نمین'),
(22, 1, 'نیر'),
(23, 1, 'هشتجین'),
(24, 1, 'هیر'),
(25, 2, 'ابریشم'),
(26, 2, 'ابوزیدآباد'),
(27, 2, 'اردستان'),
(28, 2, 'اژیه'),
(29, 2, 'اصفهان'),
(30, 2, 'افوس'),
(31, 2, 'انارک'),
(32, 2, 'ایمانشهر'),
(33, 2, 'آران وبیدگل'),
(34, 2, 'بادرود'),
(35, 2, 'باغ بهادران'),
(36, 2, 'بافران'),
(37, 2, 'برزک'),
(38, 2, 'برف انبار'),
(39, 2, 'بوئین ومیاندشت'),
(40, 2, 'بهاران شهر'),
(41, 2, 'بهارستان'),
(42, 2, 'پیربکران'),
(43, 2, 'تودشک'),
(44, 2, 'تیران'),
(45, 2, 'جندق'),
(46, 2, 'جوزدان'),
(47, 2, 'جوشقان وکامو'),
(48, 2, 'چادگان'),
(49, 2, 'چرمهین'),
(50, 2, 'چمگردان'),
(51, 2, 'حبیب آباد'),
(52, 2, 'حسن آباد'),
(53, 2, 'حنا'),
(54, 2, 'خالدآباد'),
(55, 2, 'خمینی شهر'),
(56, 2, 'خوانسار'),
(57, 2, 'خور'),
(58, 2, 'خوراسگان'),
(59, 2, 'خورزوق'),
(60, 2, 'دارن'),
(61, 2, 'دامنه'),
(62, 2, 'درچه پیاز'),
(63, 2, 'دستگرد'),
(64, 2, 'دولت آباد'),
(65, 2, 'دهاقان'),
(66, 2, 'دهق'),
(67, 2, 'دیزیچه'),
(68, 2, 'رزوه'),
(69, 2, 'رضوانشهر'),
(70, 2, 'زاینده رود'),
(71, 2, 'زرین شهر'),
(72, 2, 'زواره'),
(73, 2, 'زیباشهر'),
(74, 2, 'سده لنجان'),
(75, 2, 'سفیدشهر'),
(76, 2, 'سگزی'),
(77, 2, 'سمیرم'),
(78, 2, 'شاپورآباد'),
(79, 2, 'شاهین شهر'),
(80, 2, 'شهرضا'),
(81, 2, 'طالخونچه'),
(82, 2, 'عسگران'),
(83, 2, 'علویچه'),
(84, 2, 'فرخی'),
(85, 2, 'فریدونشهر'),
(86, 2, 'فلاورجان'),
(87, 2, 'فولادشهر'),
(88, 2, 'قمصر'),
(89, 2, 'قهجاورستان'),
(90, 2, 'قهدریجان'),
(91, 2, 'کاشان'),
(92, 2, 'کرکوند'),
(93, 2, 'کلیشادوسودرجان'),
(94, 2, 'کمشچه'),
(95, 2, 'کمه'),
(96, 2, 'کوشک'),
(97, 2, 'کوهپایه'),
(98, 2, 'کهریزسنگ'),
(99, 2, 'گرگاب'),
(100, 2, 'گزبرخوار'),
(101, 2, 'گلپایگان'),
(102, 2, 'گلدشت'),
(103, 2, 'گلشن'),
(104, 2, 'گلشهر'),
(105, 2, 'گوگد'),
(106, 2, 'لای بید'),
(107, 2, 'مبارکه'),
(108, 2, 'محمدآباد'),
(109, 2, 'مشکات'),
(110, 2, 'منظریه'),
(111, 2, 'مهاباد'),
(112, 2, 'میمه'),
(113, 2, 'نائین'),
(114, 2, 'نجف آباد'),
(115, 2, 'نصرآباد'),
(116, 2, 'نطنز'),
(117, 2, 'نوش آباد'),
(118, 2, 'نیاسر'),
(119, 2, 'نیک آباد'),
(120, 2, 'ورزنه'),
(121, 2, 'ورنامخواست'),
(122, 2, 'وزوان'),
(123, 2, 'ونک'),
(124, 2, 'هرند'),
(125, 3, 'اشتهارد'),
(126, 3, 'آسارا'),
(127, 3, 'تنکمان'),
(128, 3, 'چهارباغ'),
(129, 3, 'سیف آباد'),
(130, 3, 'شهرجدیدهشتگرد'),
(131, 3, 'طالقان'),
(132, 3, 'کرج'),
(133, 3, 'کمال شهر'),
(134, 3, 'کوهسار'),
(135, 3, 'گرمدره'),
(136, 3, 'ماهدشت'),
(137, 3, 'محمدشهر'),
(138, 3, 'مشکین دشت'),
(139, 3, 'نظرآباد'),
(140, 3, 'هشتگرد'),
(141, 4, 'ارکواز'),
(142, 4, 'ایلام'),
(143, 4, 'ایوان'),
(144, 4, 'آبدانان'),
(145, 4, 'آسمان آباد'),
(146, 4, 'بدره'),
(147, 4, 'پهله'),
(148, 4, 'توحید'),
(149, 4, 'چوار'),
(150, 4, 'دره شهر'),
(151, 4, 'دلگشا'),
(152, 4, 'دهلران'),
(153, 4, 'زرنه'),
(154, 4, 'سراب باغ'),
(155, 4, 'سرابله'),
(156, 4, 'صالح آباد'),
(157, 4, 'لومار'),
(158, 4, 'مورموری'),
(159, 4, 'موسیان'),
(160, 4, 'مهران'),
(161, 4, 'میمه'),
(162, 5, 'اسکو'),
(163, 5, 'اهر'),
(164, 5, 'ایلخچی'),
(165, 5, 'آبش احمد'),
(166, 5, 'آذرشهر'),
(167, 5, 'آقکند'),
(168, 5, 'باسمنج'),
(169, 5, 'بخشایش'),
(170, 5, 'بستان آباد'),
(171, 5, 'بناب'),
(172, 5, 'بناب جدید'),
(173, 5, 'تبریز'),
(174, 5, 'ترک'),
(175, 5, 'ترکمانچای'),
(176, 5, 'تسوج'),
(177, 5, 'تیکمه داش'),
(178, 5, 'جلفا'),
(179, 5, 'خاروانا'),
(180, 5, 'خامنه'),
(181, 5, 'خراجو'),
(182, 5, 'خسروشهر'),
(183, 5, 'خمارلو'),
(184, 5, 'خواجه'),
(185, 5, 'دوزدوزان'),
(186, 5, 'زرنق'),
(187, 5, 'زنوز'),
(188, 5, 'سراب'),
(189, 5, 'سردرود'),
(190, 5, 'سیس'),
(191, 5, 'سیه رود'),
(192, 5, 'شبستر'),
(193, 5, 'شربیان'),
(194, 5, 'شرفخانه'),
(195, 5, 'شندآباد'),
(196, 5, 'شهرجدیدسهند'),
(197, 5, 'صوفیان'),
(198, 5, 'عجب شیر'),
(199, 5, 'قره آغاج'),
(200, 5, 'کشکسرای'),
(201, 5, 'کلوانق'),
(202, 5, 'کلیبر'),
(203, 5, 'کوزه کنان'),
(204, 5, 'گوگان'),
(205, 5, 'لیلان'),
(206, 5, 'مراغه'),
(207, 5, 'مرند'),
(208, 5, 'ملکان'),
(209, 5, 'ممقان'),
(210, 5, 'مهربان'),
(211, 5, 'میانه'),
(212, 5, 'نظرکهریزی'),
(213, 5, 'وایقان'),
(214, 5, 'ورزقان'),
(215, 5, 'هادیشهر'),
(216, 5, 'هریس'),
(217, 5, 'هشترود'),
(218, 5, 'هوراند'),
(219, 5, 'یامچی'),
(220, 6, 'ارومیه'),
(221, 6, 'اشنویه'),
(222, 6, 'ایواوغلی'),
(223, 6, 'آواجیق'),
(224, 6, 'باروق'),
(225, 6, 'بازرگان'),
(226, 6, 'بوکان'),
(227, 6, 'پلدشت'),
(228, 6, 'پیرانشهر'),
(229, 6, 'تازه شهر'),
(230, 6, 'تکاب'),
(231, 6, 'چهاربرج'),
(232, 6, 'خلیفان'),
(233, 6, 'خوی'),
(234, 6, 'دیزج دیز'),
(235, 6, 'ربط'),
(236, 6, 'سردشت'),
(237, 6, 'سرو'),
(238, 6, 'سلماس'),
(239, 6, 'سیلوانه'),
(240, 6, 'سیمینه'),
(241, 6, 'سیه چشمه'),
(242, 6, 'شاهین دژ'),
(243, 6, 'شوط'),
(244, 6, 'فیرورق'),
(245, 6, 'قره ضیاءالدین'),
(246, 6, 'قطور'),
(247, 6, 'قوشچی'),
(248, 6, 'کشاورز'),
(249, 6, 'گردکشانه'),
(250, 6, 'ماکو'),
(251, 6, 'محمدیار'),
(252, 6, 'محمودآباد'),
(253, 6, 'مهاباد'),
(254, 6, 'میاندوآب'),
(255, 6, 'میرآباد'),
(256, 6, 'نالوس'),
(257, 6, 'نقده'),
(258, 6, 'نوشین'),
(259, 7, 'امام حسن'),
(260, 7, 'انارستان'),
(261, 7, 'اهرم'),
(262, 7, 'آبپخش'),
(263, 7, 'آبدان'),
(264, 7, 'برازجان'),
(265, 7, 'بردخون'),
(266, 7, 'بردستان'),
(267, 7, 'بندردیر'),
(268, 7, 'بندردیلم'),
(269, 7, 'بندرریگ'),
(270, 7, 'بندرکنگان'),
(271, 7, 'بندرگناوه'),
(272, 7, 'بنک'),
(273, 7, 'بوشهر'),
(274, 7, 'تنگ ارم'),
(275, 7, 'جم'),
(276, 7, 'چغادک'),
(277, 7, 'خارک'),
(278, 7, 'خورموج'),
(279, 7, 'دالکی'),
(280, 7, 'دلوار'),
(281, 7, 'ریز'),
(282, 7, 'سعدآباد'),
(283, 7, 'سیراف'),
(284, 7, 'شبانکاره'),
(285, 7, 'شنبه'),
(286, 7, 'عسلویه'),
(287, 7, 'کاکی'),
(288, 7, 'کلمه'),
(289, 7, 'نخل تقی'),
(290, 7, 'وحدتیه'),
(291, 8, 'ارجمند'),
(292, 8, 'اسلامشهر'),
(293, 8, 'اندیشه'),
(294, 8, 'آبسرد'),
(295, 8, 'آبعلی'),
(296, 8, 'باغستان'),
(297, 8, 'باقرشهر'),
(298, 8, 'بومهن'),
(299, 8, 'پاکدشت'),
(300, 8, 'پردیس'),
(301, 8, 'پیشوا'),
(302, 8, 'تجریش'),
(303, 8, 'تهران'),
(304, 8, 'جوادآباد'),
(305, 8, 'چهاردانگه'),
(306, 8, 'حسن آباد'),
(307, 8, 'دماوند'),
(308, 8, 'رباط کریم'),
(309, 8, 'رودهن'),
(310, 8, 'ری'),
(311, 8, 'شاهدشهر'),
(312, 8, 'شریف آباد'),
(313, 8, 'شهریار'),
(314, 8, 'صالح آباد'),
(315, 8, 'صباشهر'),
(316, 8, 'صفادشت'),
(317, 8, 'فردوسیه'),
(318, 8, 'فرون آباد'),
(319, 8, 'فشم'),
(320, 8, 'فیروزکوه'),
(321, 8, 'قدس'),
(322, 8, 'قرچک'),
(323, 8, 'کهریزک'),
(324, 8, 'کیلان'),
(325, 8, 'گلستان'),
(326, 8, 'لواسان'),
(327, 8, 'ملارد'),
(328, 8, 'نسیم شهر'),
(329, 8, 'نصیرآباد'),
(330, 8, 'وحیدیه'),
(331, 8, 'ورامین'),
(332, 9, 'اردل'),
(333, 9, 'آلونی'),
(334, 9, 'باباحیدر'),
(335, 9, 'بروجن'),
(336, 9, 'بلداجی'),
(337, 9, 'بن'),
(338, 9, 'جونقان'),
(339, 9, 'چلگرد'),
(340, 9, 'سامان'),
(341, 9, 'سفیددشت'),
(342, 9, 'سودجان'),
(343, 9, 'سورشجان'),
(344, 9, 'شلمزار'),
(345, 9, 'شهرکرد'),
(346, 9, 'طاقانک'),
(347, 9, 'فارسان'),
(348, 9, 'فرادنبه'),
(349, 9, 'فرخ شهر'),
(350, 9, 'کیان'),
(351, 9, 'گندمان'),
(352, 9, 'گهرو'),
(353, 9, 'لردگان'),
(354, 9, 'مال خلیفه'),
(355, 9, 'ناغان'),
(356, 9, 'نافچ'),
(357, 9, 'نقنه'),
(358, 9, 'هفشجان'),
(359, 10, 'ارسک'),
(360, 10, 'اسدیه'),
(361, 10, 'اسفدن'),
(362, 10, 'اسلامیه'),
(363, 10, 'آرین شهر'),
(364, 10, 'آیسک'),
(365, 10, 'بشرویه'),
(366, 10, 'بیرجند'),
(367, 10, 'حاجی آباد'),
(368, 10, 'خضری دشت بیاض'),
(369, 10, 'خوسف'),
(370, 10, 'زهان'),
(371, 10, 'سرایان'),
(372, 10, 'سربیشه'),
(373, 10, 'سه قلعه'),
(374, 10, 'شوسف'),
(375, 10, 'طبس مسینا'),
(376, 10, 'فردوس'),
(377, 10, 'قائن'),
(378, 10, 'قهستان'),
(379, 10, 'گزیک'),
(380, 10, 'محمد شهر'),
(381, 10, 'مود'),
(382, 10, 'نهبندان'),
(383, 10, 'نیمبلوک'),
(384, 11, 'احمدآبادصولت'),
(385, 11, 'انابد'),
(386, 11, 'باجگیران'),
(387, 11, 'باخرز'),
(388, 11, 'بار'),
(389, 11, 'بایگ'),
(390, 11, 'بجستان'),
(391, 11, 'بردسکن'),
(392, 11, 'بیدخت'),
(393, 11, 'تایباد'),
(394, 11, 'تربت جام'),
(395, 11, 'تربت حیدریه'),
(396, 11, 'جغتای'),
(397, 11, 'جنگل'),
(398, 11, 'چاپشلو'),
(399, 11, 'چکنه'),
(400, 11, 'چناران'),
(401, 11, 'خرو'),
(402, 11, 'خلیل آباد'),
(403, 11, 'خواف'),
(404, 11, 'داورزن'),
(405, 11, 'درگز'),
(406, 11, 'درود'),
(407, 11, 'دولت آباد'),
(408, 11, 'رباط سنگ'),
(409, 11, 'رشتخوار'),
(410, 11, 'رضویه'),
(411, 11, 'روداب'),
(412, 11, 'ریوش'),
(413, 11, 'سبزوار'),
(414, 11, 'سرخس'),
(415, 11, 'سفیدسنگ'),
(416, 11, 'سلامی'),
(417, 11, 'سلطان آباد'),
(418, 11, 'سنگان'),
(419, 11, 'شادمهر'),
(420, 11, 'شاندیز'),
(421, 11, 'ششتمد'),
(422, 11, 'شهرآباد'),
(423, 11, 'شهرزو'),
(424, 11, 'صالح آباد'),
(425, 11, 'طرقبه'),
(426, 11, 'عشق آباد'),
(427, 11, 'فرهادگرد'),
(428, 11, 'فریمان'),
(429, 11, 'فیروزه'),
(430, 11, 'فیض آباد'),
(431, 11, 'قاسم آباد'),
(432, 11, 'قدمگاه'),
(433, 11, 'قلندرآباد'),
(434, 11, 'قوچان'),
(435, 11, 'کاخک'),
(436, 11, 'کاریز'),
(437, 11, 'کاشمر'),
(438, 11, 'کدکن'),
(439, 11, 'کلات'),
(440, 11, 'کندر'),
(441, 11, 'گلمکان'),
(442, 11, 'گناباد'),
(443, 11, 'لطف آباد'),
(444, 11, 'مزدآوند'),
(445, 11, 'مشهد'),
(446, 11, 'مشهدریزه'),
(447, 11, 'ملک آباد'),
(448, 11, 'نشتیفان'),
(449, 11, 'نصر آباد'),
(450, 11, 'نقاب'),
(451, 11, 'نوخندان'),
(452, 11, 'نیشابور'),
(453, 11, 'نیل شهر'),
(454, 11, 'همت آباد'),
(455, 11, 'یونسی'),
(456, 12, 'اسفراین'),
(457, 12, 'ایور'),
(458, 12, 'آشخانه'),
(459, 12, 'بجنورد'),
(460, 12, 'پیش قلعه'),
(461, 12, 'تیتکانلو'),
(462, 12, 'جاجرم'),
(463, 12, 'حصارگرمخان'),
(464, 12, 'درق'),
(465, 12, 'راز'),
(466, 12, 'سنخواست'),
(467, 12, 'شوقان'),
(468, 12, 'شیروان'),
(469, 12, 'صفی آباد'),
(470, 12, 'فاروج'),
(471, 12, 'قاضی'),
(472, 12, 'گرمه'),
(473, 12, 'لوجلی'),
(474, 13, 'اروندکنار'),
(475, 13, 'الوان'),
(476, 13, 'امیدیه'),
(477, 13, 'اندیمشک'),
(478, 13, 'اهواز'),
(479, 13, 'ایذه'),
(480, 13, 'آبادان'),
(481, 13, 'آغاجاری'),
(482, 13, 'باغ ملک'),
(483, 13, 'بستان'),
(484, 13, 'بندرامام خمینی'),
(485, 13, 'بندرماهشهر'),
(486, 13, 'بهبهان'),
(487, 13, 'ترکالکی'),
(488, 13, 'جایزان'),
(489, 13, 'جنت مکان'),
(490, 13, 'چغامیش'),
(491, 13, 'چمران'),
(492, 13, 'چوئبده'),
(493, 13, 'حر'),
(494, 13, 'حسینیه'),
(495, 13, 'حمزه'),
(496, 13, 'حمیدیه'),
(497, 13, 'خرمشهر'),
(498, 13, 'دارخوین'),
(499, 13, 'دزآب'),
(500, 13, 'دزفول'),
(501, 13, 'دهدز'),
(502, 13, 'رامشیر'),
(503, 13, 'رامهرمز'),
(504, 13, 'رفیع'),
(505, 13, 'زهره'),
(506, 13, 'سالند'),
(507, 13, 'سردشت'),
(508, 13, 'سمله'),
(509, 13, 'سوسنگرد'),
(510, 13, 'شادگان'),
(511, 13, 'شاوور'),
(512, 13, 'شرافت'),
(513, 13, 'شوش'),
(514, 13, 'شوشتر'),
(515, 13, 'شیبان'),
(516, 13, 'صالح شهر'),
(517, 13, 'صالح مشطط'),
(518, 13, 'صفی آباد'),
(519, 13, 'صیدون'),
(520, 13, 'قلعه تل'),
(521, 13, 'قلعه خواجه'),
(522, 13, 'گتوند'),
(523, 13, 'گوریه'),
(524, 13, 'لالی'),
(525, 13, 'مسجدسلیمان'),
(526, 13, 'مشراگه'),
(527, 13, 'مقاومت'),
(528, 13, 'ملاثانی'),
(529, 13, 'میانرود'),
(530, 13, 'میداود'),
(531, 13, 'مینوشهر'),
(532, 13, 'ویس'),
(533, 13, 'هفتگل'),
(534, 13, 'هندیجان'),
(535, 13, 'هویزه'),
(536, 14, 'ابهر'),
(537, 14, 'ارمغانخانه'),
(538, 14, 'آب بر'),
(539, 14, 'چورزق'),
(540, 14, 'حلب'),
(541, 14, 'خرمدره'),
(542, 14, 'دندی'),
(543, 14, 'زرین آباد'),
(544, 14, 'زرین رود'),
(545, 14, 'زنجان'),
(546, 14, 'سجاس'),
(547, 14, 'سلطانیه'),
(548, 14, 'سهرورد'),
(549, 14, 'صائین قلعه'),
(550, 14, 'قیدار'),
(551, 14, 'گرماب'),
(552, 14, 'ماه نشان'),
(553, 14, 'هیدج'),
(554, 15, 'امیریه'),
(555, 15, 'ایوانکی'),
(556, 15, 'آرادان'),
(557, 15, 'بسطام'),
(558, 15, 'بیارجمند'),
(559, 15, 'دامغان'),
(560, 15, 'درجزین'),
(561, 15, 'دیباج'),
(562, 15, 'سرخه'),
(563, 15, 'سمنان'),
(564, 15, 'شاهرود'),
(565, 15, 'شهمیرزاد'),
(566, 15, 'کلاته خیج'),
(567, 15, 'گرمسار'),
(568, 15, 'مجن'),
(569, 15, 'مهدی شهر'),
(570, 15, 'میامی'),
(571, 16, 'ادیمی'),
(572, 16, 'اسپکه'),
(573, 16, 'ایرانشهر'),
(574, 16, 'بزمان'),
(575, 16, 'بمپور'),
(576, 16, 'بنت'),
(577, 16, 'بنجار'),
(578, 16, 'پیشین'),
(579, 16, 'جالق'),
(580, 16, 'چاه بهار'),
(581, 16, 'خاش'),
(582, 16, 'دوست محمد'),
(583, 16, 'راسک'),
(584, 16, 'زابل'),
(585, 16, 'زابلی'),
(586, 16, 'زاهدان'),
(587, 16, 'زرآباد'),
(588, 16, 'زهک'),
(589, 16, 'سراوان'),
(590, 16, 'سرباز'),
(591, 16, 'سوران'),
(592, 16, 'سیرکان'),
(593, 16, 'علی اکبر'),
(594, 16, 'فنوج'),
(595, 16, 'قصرقند'),
(596, 16, 'کنارک'),
(597, 16, 'گشت'),
(598, 16, 'گلمورتی'),
(599, 16, 'محمدان'),
(600, 16, 'محمد آباد'),
(601, 16, 'محمدی'),
(602, 16, 'میرجاوه'),
(603, 16, 'نصرت آباد'),
(604, 16, 'نگور'),
(605, 16, 'نوک آباد'),
(606, 16, 'نیک شهر'),
(607, 16, 'هیدوج'),
(608, 17, 'اردکان'),
(609, 17, 'ارسنجان'),
(610, 17, 'استهبان'),
(611, 17, 'اسیر'),
(612, 17, 'اشکنان'),
(613, 17, 'افزر'),
(614, 17, 'اقلید'),
(615, 17, 'امام شهر'),
(616, 17, 'اوز'),
(617, 17, 'اهل'),
(618, 17, 'ایج'),
(619, 17, 'ایزدخواست'),
(620, 17, 'آباده'),
(621, 17, 'آباده طشک'),
(622, 17, 'باب انار'),
(623, 17, 'بالاده'),
(624, 17, 'بنارویه'),
(625, 17, 'بوانات'),
(626, 17, 'بهمن'),
(627, 17, 'بیرم'),
(628, 17, 'بیضا'),
(629, 17, 'جنت شهر'),
(630, 17, 'جویم'),
(631, 17, 'جهرم'),
(632, 17, 'حاجی آباد'),
(633, 17, 'حسامی'),
(634, 17, 'حسن آباد'),
(635, 17, 'خانه زنیان'),
(636, 17, 'خاوران'),
(637, 17, 'خرامه'),
(638, 17, 'خشت'),
(639, 17, 'خنج'),
(640, 17, 'خور'),
(641, 17, 'خومه زار'),
(642, 17, 'داراب'),
(643, 17, 'داریان'),
(644, 17, 'دبیران'),
(645, 17, 'دژکرد'),
(646, 17, 'دوبرجی'),
(647, 17, 'دوزه'),
(648, 17, 'دهرم'),
(649, 17, 'رامجرد'),
(650, 17, 'رونیز'),
(651, 17, 'زاهدشهر'),
(652, 17, 'زرقان'),
(653, 17, 'سده'),
(654, 17, 'سروستان'),
(655, 17, 'سعادت شهر'),
(656, 17, 'سورمق'),
(657, 17, 'سیدان'),
(658, 17, 'ششده'),
(659, 17, 'شهر جدید صدرا'),
(660, 17, 'شهرپیر'),
(661, 17, 'شیراز'),
(662, 17, 'صغاد'),
(663, 17, 'صفاشهر'),
(664, 17, 'علامرودشت'),
(665, 17, 'عمادده'),
(666, 17, 'فدامی'),
(667, 17, 'فراشبند'),
(668, 17, 'فسا'),
(669, 17, 'فیروزآباد'),
(670, 17, 'قادرآباد'),
(671, 17, 'قائمیه'),
(672, 17, 'قطب آباد'),
(673, 17, 'قطرویه'),
(674, 17, 'قیر'),
(675, 17, 'کارزین'),
(676, 17, 'کازرون'),
(677, 17, 'کامفیروز'),
(678, 17, 'کره ای'),
(679, 17, 'کنارتخته'),
(680, 17, 'کوار'),
(681, 17, 'کوهنجان'),
(682, 17, 'گراش'),
(683, 17, 'گله دار'),
(684, 17, 'لار'),
(685, 17, 'لامرد'),
(686, 17, 'لپوئی'),
(687, 17, 'لطیفی'),
(688, 17, 'مبارک آباد'),
(689, 17, 'مرودشت'),
(690, 17, 'مشکان'),
(691, 17, 'مصیری'),
(692, 17, 'مهر'),
(693, 17, 'میمند'),
(694, 17, 'نوبندگان'),
(695, 17, 'نوجین'),
(696, 17, 'نودان'),
(697, 17, 'نورآباد'),
(698, 17, 'نی ریز'),
(699, 17, 'وراوی'),
(700, 17, 'هماشهر'),
(701, 18, 'ارداق'),
(702, 18, 'اسفرورین'),
(703, 18, 'اقبالیه'),
(704, 18, 'الوند'),
(705, 18, 'آبگرم'),
(706, 18, 'آبیک'),
(707, 18, 'آوج'),
(708, 18, 'بوئین زهرا'),
(709, 18, 'بیدستان'),
(710, 18, 'تاکستان'),
(711, 18, 'خاکعلی'),
(712, 18, 'خرمدشت'),
(713, 18, 'دانسفهان'),
(714, 18, 'رازمیان'),
(715, 18, 'سگزآباد'),
(716, 18, 'سیردان'),
(717, 18, 'شال'),
(718, 18, 'شریفیه'),
(719, 18, 'ضیاءآباد'),
(720, 18, 'قزوین'),
(721, 18, 'کوهین'),
(722, 18, 'محمدیه'),
(723, 18, 'محمودآبادنمونه'),
(724, 18, 'معلم کلایه'),
(725, 18, 'نرجه'),
(726, 19, 'جعفریه'),
(727, 19, 'دستجرد'),
(728, 19, 'سلفچگان'),
(729, 19, 'قم'),
(730, 19, 'قنوات'),
(731, 19, 'کهک'),
(732, 20, 'آرمرده'),
(733, 20, 'بابارشانی'),
(734, 20, 'بانه'),
(735, 20, 'بلبان آباد'),
(736, 20, 'بوئین سفلی'),
(737, 20, 'بیجار'),
(738, 20, 'چناره'),
(739, 20, 'دزج'),
(740, 20, 'دلبران'),
(741, 20, 'دهگلان'),
(742, 20, 'دیواندره'),
(743, 20, 'زرینه'),
(744, 20, 'سروآباد'),
(745, 20, 'سریش آباد'),
(746, 20, 'سقز'),
(747, 20, 'سنندج'),
(748, 20, 'شویشه'),
(749, 20, 'صاحب'),
(750, 20, 'قروه'),
(751, 20, 'کامیاران'),
(752, 20, 'کانی دینار'),
(753, 20, 'کانی سور'),
(754, 20, 'مریوان'),
(755, 20, 'موچش'),
(756, 20, 'یاسوکند'),
(757, 21, 'اختیارآباد'),
(758, 21, 'ارزوئیه'),
(759, 21, 'امین شهر'),
(760, 21, 'انار'),
(761, 21, 'اندوهجرد'),
(762, 21, 'باغین'),
(763, 21, 'بافت'),
(764, 21, 'بردسیر'),
(765, 21, 'بروات'),
(766, 21, 'بزنجان'),
(767, 21, 'بم'),
(768, 21, 'بهرمان'),
(769, 21, 'پاریز'),
(770, 21, 'جبالبارز'),
(771, 21, 'جوپار'),
(772, 21, 'جوزم'),
(773, 21, 'جیرفت'),
(774, 21, 'چترود'),
(775, 21, 'خاتون آباد'),
(776, 21, 'خانوک'),
(777, 21, 'خورسند'),
(778, 21, 'درب بهشت'),
(779, 21, 'دوساری'),
(780, 21, 'دهج'),
(781, 21, 'رابر'),
(782, 21, 'راور'),
(783, 21, 'راین'),
(784, 21, 'رفسنجان'),
(785, 21, 'رودبار'),
(786, 21, 'ریحان شهر'),
(787, 21, 'زرند'),
(788, 21, 'زنگی آباد'),
(789, 21, 'زیدآباد'),
(790, 21, 'سرچشمه'),
(791, 21, 'سیرجان'),
(792, 21, 'شهداد'),
(793, 21, 'شهربابک'),
(794, 21, 'صفائیه'),
(795, 21, 'عنبرآباد'),
(796, 21, 'فاریاب'),
(797, 21, 'فهرج'),
(798, 21, 'قلعه گنج'),
(799, 21, 'کاظم آباد'),
(800, 21, 'کرمان'),
(801, 21, 'کشکوئیه'),
(802, 21, 'کوهبنان'),
(803, 21, 'کهنوج'),
(804, 21, 'کیانشهر'),
(805, 21, 'گلباف'),
(806, 21, 'گلزار'),
(807, 21, 'لاله زار'),
(808, 21, 'ماهان'),
(809, 21, 'محمد آباد'),
(810, 21, 'محی آباد'),
(811, 21, 'مردهک'),
(812, 21, 'منوجان'),
(813, 21, 'نجف شهر'),
(814, 21, 'نرماشیر'),
(815, 21, 'نظام شهر'),
(816, 21, 'نگار'),
(817, 21, 'نودژ'),
(818, 21, 'هجدک'),
(819, 21, 'هماشهر'),
(820, 21, 'یزدان شهر'),
(821, 22, 'ازگله'),
(822, 22, 'اسلام آبادغرب'),
(823, 22, 'باینگان'),
(824, 22, 'بیستون'),
(825, 22, 'پاوه'),
(826, 22, 'تازه آباد'),
(827, 22, 'جوانرود'),
(828, 22, 'حمیل'),
(829, 22, 'رباط'),
(830, 22, 'روانسر'),
(831, 22, 'سرپل ذهاب'),
(832, 22, 'سرمست'),
(833, 22, 'سطر'),
(834, 22, 'سنقر'),
(835, 22, 'سومار'),
(836, 22, 'شاهو'),
(837, 22, 'صحنه'),
(838, 22, 'قصرشیرین'),
(839, 22, 'کرمانشاه'),
(840, 22, 'کرندغرب'),
(841, 22, 'کنگاور'),
(842, 22, 'کوزران'),
(843, 22, 'گهواره'),
(844, 22, 'گیلانغرب'),
(845, 22, 'میان راهان'),
(846, 22, 'نودشه'),
(847, 22, 'نوسود'),
(848, 22, 'هرسین'),
(849, 22, 'هلشی'),
(850, 23, 'باشت'),
(851, 23, 'پاتاوه'),
(852, 23, 'چرام'),
(853, 23, 'چیتاب'),
(854, 23, 'دوگنبدان'),
(855, 23, 'دهدشت'),
(856, 23, 'دیشموک'),
(857, 23, 'سوق'),
(858, 23, 'سی سخت'),
(859, 23, 'قلعه رئیسی'),
(860, 23, 'گراب سفلی'),
(861, 23, 'لنده'),
(862, 23, 'لیکک'),
(863, 23, 'مادوان'),
(864, 23, 'مارگون'),
(865, 23, 'یاسوج'),
(866, 24, 'انبارآلوم'),
(867, 24, 'اینچه برون'),
(868, 24, 'آزادشهر'),
(869, 24, 'آق قلا'),
(870, 24, 'بندرگز'),
(871, 24, 'ترکمن'),
(872, 24, 'جلین'),
(873, 24, 'خان ببین'),
(874, 24, 'دلند'),
(875, 24, 'رامیان'),
(876, 24, 'سرخنکلاته'),
(877, 24, 'سیمین شهر'),
(878, 24, 'علی آباد'),
(879, 24, 'فاضل آباد'),
(880, 24, 'کردکوی'),
(881, 24, 'کلاله'),
(882, 24, 'گالیکش'),
(883, 24, 'گرگان'),
(884, 24, 'گمیش تپه'),
(885, 24, 'گنبد کاووس'),
(886, 24, 'مراوه تپه'),
(887, 24, 'مینودشت'),
(888, 24, 'نگین شهر'),
(889, 24, 'نوده خاندوز'),
(890, 24, 'نوکنده'),
(891, 25, 'احمدسرگوراب'),
(892, 25, 'اسالم'),
(893, 25, 'اطاقور'),
(894, 25, 'املش'),
(895, 25, 'آستارا'),
(896, 25, 'آستانه اشرفیه'),
(897, 25, 'بازارجمعه'),
(898, 25, 'بره سر'),
(899, 25, 'بندرانزلی'),
(900, 25, 'پره سر'),
(901, 25, 'توتکابن'),
(902, 25, 'جیرنده'),
(903, 25, 'چابکسر'),
(904, 25, 'چاف وچمخاله'),
(905, 25, 'چوبر'),
(906, 25, 'حویق'),
(907, 25, 'خشکبیجار'),
(908, 25, 'خمام'),
(909, 25, 'دیلمان'),
(910, 25, 'رانکوه'),
(911, 25, 'رحیم آباد'),
(912, 25, 'رستم آباد'),
(913, 25, 'رشت'),
(914, 25, 'رضوانشهر'),
(915, 25, 'رودبار'),
(916, 25, 'رودبنه'),
(917, 25, 'رودسر'),
(918, 25, 'سنگر'),
(919, 25, 'سیاهکل'),
(920, 25, 'شفت'),
(921, 25, 'شلمان'),
(922, 25, 'صومعه سرا'),
(923, 25, 'فومن'),
(924, 25, 'کلاچای'),
(925, 25, 'کوچصفهان'),
(926, 25, 'کومله'),
(927, 25, 'کیاشهر'),
(928, 25, 'گوراب زرمیخ'),
(929, 25, 'لاهیجان'),
(930, 25, 'لشت نشاء'),
(931, 25, 'لنگرود'),
(932, 25, 'لوشان'),
(933, 25, 'لولمان'),
(934, 25, 'لوندویل'),
(935, 25, 'لیسار'),
(936, 25, 'ماسال'),
(937, 25, 'ماسوله'),
(938, 25, 'مرجقل'),
(939, 25, 'منجیل'),
(940, 25, 'واجارگاه'),
(941, 25, 'هشتپر'),
(942, 26, 'ازنا'),
(943, 26, 'اشترینان'),
(944, 26, 'الشتر'),
(945, 26, 'الیگودرز'),
(946, 26, 'بروجرد'),
(947, 26, 'پلدختر'),
(948, 26, 'چالانچولان'),
(949, 26, 'چغلوندی'),
(950, 26, 'چقابل'),
(951, 26, 'خرم آباد'),
(952, 26, 'درب گنبد'),
(953, 26, 'دورود'),
(954, 26, 'زاغه'),
(955, 26, 'سپیددشت'),
(956, 26, 'سراب دوره'),
(957, 26, 'شول آباد'),
(958, 26, 'فیروز آباد'),
(959, 26, 'کونانی'),
(960, 26, 'کوهدشت'),
(961, 26, 'گراب'),
(962, 26, 'معمولان'),
(963, 26, 'مؤمن آباد'),
(964, 26, 'نور آباد'),
(965, 26, 'ویسیان'),
(966, 26, 'هفت چشمه'),
(967, 27, 'امیرکلا'),
(968, 27, 'ایزدشهر'),
(969, 27, 'آلاشت'),
(970, 27, 'آمل'),
(971, 27, 'بابل'),
(972, 27, 'بابلسر'),
(973, 27, 'بلده'),
(974, 27, 'بهشهر'),
(975, 27, 'بهنمیر'),
(976, 27, 'پل سفید'),
(977, 27, 'پول'),
(978, 27, 'تنکابن'),
(979, 27, 'جویبار'),
(980, 27, 'چالوس'),
(981, 27, 'چمستان'),
(982, 27, 'خرم آباد'),
(983, 27, 'خلیل شهر'),
(984, 27, 'خشکبیجار'),
(985, 27, 'دابودشت'),
(986, 27, 'رامسر'),
(987, 27, 'رستمکلا'),
(988, 27, 'رویان'),
(989, 27, 'رینه'),
(990, 27, 'زرگر محله'),
(991, 27, 'زیرآب'),
(992, 27, 'ساری'),
(993, 27, 'سرخرود'),
(994, 27, 'سلمان شهر'),
(995, 27, 'سورک'),
(996, 27, 'شیرگاه'),
(997, 27, 'شیرود'),
(998, 27, 'عباس آباد'),
(999, 27, 'فریدونکنار'),
(1000, 27, 'فریم'),
(1001, 27, 'قائم شهر'),
(1002, 27, 'کتالم وسادات شهر'),
(1003, 27, 'کلارآباد'),
(1004, 27, 'کلاردشت'),
(1005, 27, 'کله بست'),
(1006, 27, 'کوهی خیل'),
(1007, 27, 'کیاسر'),
(1008, 27, 'کیاکلا'),
(1009, 27, 'گتاب'),
(1010, 27, 'گزنک'),
(1011, 27, 'گلوگاه'),
(1012, 27, 'محمود آباد'),
(1013, 27, 'مرزن آباد'),
(1014, 27, 'مرزیکلا'),
(1015, 27, 'نشتارود'),
(1016, 27, 'نکا'),
(1017, 27, 'نور'),
(1018, 27, 'نوشهر'),
(1019, 28, 'اراک'),
(1020, 28, 'آستانه'),
(1021, 28, 'آشتیان'),
(1022, 28, 'پرندک'),
(1023, 28, 'تفرش'),
(1024, 28, 'توره'),
(1025, 28, 'جاورسیان'),
(1026, 28, 'خشکرود'),
(1027, 28, 'خمین'),
(1028, 28, 'خنداب'),
(1029, 28, 'داودآباد'),
(1030, 28, 'دلیجان'),
(1031, 28, 'رازقان'),
(1032, 28, 'زاویه'),
(1033, 28, 'ساروق'),
(1034, 28, 'ساوه'),
(1035, 28, 'سنجان'),
(1036, 28, 'شازند'),
(1037, 28, 'شهرجدیدمهاجران'),
(1038, 28, 'غرق آباد'),
(1039, 28, 'فرمهین'),
(1040, 28, 'قورچی باشی'),
(1041, 28, 'کرهرود'),
(1042, 28, 'کمیجان'),
(1043, 28, 'مأمونیه'),
(1044, 28, 'محلات'),
(1045, 28, 'میلاجرد'),
(1046, 28, 'نراق'),
(1047, 28, 'نوبران'),
(1048, 28, 'نیمور'),
(1049, 28, 'هندودر'),
(1050, 29, 'ابوموسی'),
(1051, 29, 'بستک'),
(1052, 29, 'بندرجاسک'),
(1053, 29, 'بندرچارک'),
(1054, 29, 'بندرعباس'),
(1055, 29, 'بندرلنگه'),
(1056, 29, 'بیکاه'),
(1057, 29, 'پارسیان'),
(1058, 29, 'تخت'),
(1059, 29, 'جناح'),
(1060, 29, 'حاجی آباد'),
(1061, 29, 'خمیر'),
(1062, 29, 'درگهان'),
(1063, 29, 'دهبارز'),
(1064, 29, 'رویدر'),
(1065, 29, 'زیارتعلی'),
(1066, 29, 'سردشت بشاگرد'),
(1067, 29, 'سرگز'),
(1068, 29, 'سندرک'),
(1069, 29, 'سوزا'),
(1070, 29, 'سیریک'),
(1071, 29, 'فارغان'),
(1072, 29, 'فین'),
(1073, 29, 'قشم'),
(1074, 29, 'قلعه قاضی'),
(1075, 29, 'کنگ'),
(1076, 29, 'کوشکنار'),
(1077, 29, 'کیش'),
(1078, 29, 'گوهران'),
(1079, 29, 'میناب'),
(1080, 29, 'هرمز'),
(1081, 29, 'هشتبندی'),
(1082, 30, 'ازندریان'),
(1083, 30, 'اسدآباد'),
(1084, 30, 'برزول'),
(1085, 30, 'بهار'),
(1086, 30, 'تویسرکان'),
(1087, 30, 'جورقان'),
(1088, 30, 'جوکار'),
(1089, 30, 'دمق'),
(1090, 30, 'رزن'),
(1091, 30, 'زنگنه'),
(1092, 30, 'سامن'),
(1093, 30, 'سرکان'),
(1094, 30, 'شیرین سو'),
(1095, 30, 'صالح آباد'),
(1096, 30, 'فامنین'),
(1097, 30, 'فرسفج'),
(1098, 30, 'فیروزان'),
(1099, 30, 'قروه در جزین'),
(1100, 30, 'قهاوند'),
(1101, 30, 'کبودرآهنگ'),
(1102, 30, 'گل تپه'),
(1103, 30, 'گیان'),
(1104, 30, 'لالجین'),
(1105, 30, 'مریانج'),
(1106, 30, 'ملایر'),
(1107, 30, 'نهاوند'),
(1108, 30, 'همدان'),
(1109, 31, 'ابرکوه'),
(1110, 31, 'احمدآباد'),
(1111, 31, 'اردکان'),
(1112, 31, 'اشکذر'),
(1113, 31, 'بافق'),
(1114, 31, 'بفروئیه'),
(1115, 31, 'بهاباد'),
(1116, 31, 'تفت'),
(1117, 31, 'حمیدیا'),
(1118, 31, 'خضرآباد'),
(1119, 31, 'دیهوک'),
(1120, 31, 'زارچ'),
(1121, 31, 'شاهدیه'),
(1122, 31, 'طبس'),
(1123, 31, 'عشق آباد'),
(1124, 31, 'عقدا'),
(1125, 31, 'مروست'),
(1126, 31, 'مهردشت'),
(1127, 31, 'مهریز'),
(1128, 31, 'میبد'),
(1129, 31, 'ندوشن'),
(1130, 31, 'نیر'),
(1131, 31, 'هرات'),
(1132, 31, 'یزد');

-- --------------------------------------------------------

--
-- Table structure for table `login_logs`
--

CREATE TABLE `login_logs` (
  `id` int NOT NULL,
  `user_id` int DEFAULT NULL,
  `username` varchar(50) COLLATE utf8mb3_persian_ci NOT NULL,
  `ip_address` varchar(45) COLLATE utf8mb3_persian_ci NOT NULL,
  `user_agent` text COLLATE utf8mb3_persian_ci,
  `success` tinyint(1) NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

CREATE TABLE `messages` (
  `id` int NOT NULL COMMENT 'کد پیام',
  `realname` varchar(70) COLLATE utf8mb3_persian_ci NOT NULL COMMENT 'نام کامل',
  `email` varchar(50) COLLATE utf8mb3_persian_ci NOT NULL COMMENT 'پست الکترونیک',
  `content` text COLLATE utf8mb3_persian_ci NOT NULL COMMENT 'متن پیام'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci COMMENT='جدول پیامها';

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`id`, `realname`, `email`, `content`) VALUES
(1, 'Ø¹Ù„ÛŒ Ø§Ù„Ù…Ø§Ø³ÛŒ', 'a710almasi@gmail.com', 'Ø³Ù„Ø§Ù… Ùˆ Ø®Ø³ØªÙ‡ Ù†Ø¨Ø§Ø´ÛŒØ¯. Ù…Ù…Ù†ÙˆÙ† Ø§Ø² Ø³Ø§ÛŒØª Ø®ÙˆØ¨ØªÙˆÙ†.'),
(2, 'Ø§Ø±Ø³Ù„Ø§Ù† Ø§Ù„Ù…Ø§Ø³ÛŒ', 'arsalan@almasi.ir', 'Ø³Ù„Ø§Ù…. Ù…ÛŒØ®ÙˆØ§Ø³ØªÙ… Ø¯Ø±Ù…ÙˆØ±Ø¯ Ø³ÙØ§Ø±Ø´Ù… Ù¾ÛŒÚ¯ÛŒØ±ÛŒ Ú©Ù†Ù…. Ú©Ø¯ Ø³ÙØ§Ø±Ø´ Ø¨Ù†Ø¯Ù‡ 1478536291 Ù‡Ø³ØªØ´. Ù…Ù…Ù†ÙˆÙ†Ù….');

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` int NOT NULL COMMENT 'شماره سفارش',
  `user_id` int NOT NULL,
  `username` varchar(30) COLLATE utf8mb3_persian_ci NOT NULL COMMENT 'نام کاربری سفارش دهنده',
  `orderdate` varchar(20) COLLATE utf8mb3_persian_ci NOT NULL COMMENT 'تاریخ سفارش',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `number` varchar(11) COLLATE utf8mb3_persian_ci NOT NULL COMMENT 'شماره تماس',
  `address` varchar(400) COLLATE utf8mb3_persian_ci NOT NULL COMMENT 'آدرس',
  `province` varchar(50) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `city` varchar(50) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `postal_code` varchar(10) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `trackcode` varchar(24) CHARACTER SET utf8mb3 COLLATE utf8mb3_persian_ci DEFAULT NULL COMMENT 'کد مرسوله پستی',
  `status` varchar(20) COLLATE utf8mb3_persian_ci NOT NULL DEFAULT 'pending',
  `payment_method` varchar(20) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `crypto_type` varchar(20) COLLATE utf8mb3_persian_ci DEFAULT NULL,
  `notes` text COLLATE utf8mb3_persian_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci COMMENT='جدول سفارشات';

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `username`, `orderdate`, `created_at`, `updated_at`, `number`, `address`, `province`, `city`, `postal_code`, `trackcode`, `status`, `payment_method`, `crypto_type`, `notes`) VALUES
(3, 25, 'ehsan1', '2025-09-01 09:35:07', '2025-09-01 06:05:07', '2025-09-01 07:40:21', '09234564356', 'تهران تهران پارس', 'تهران', 'تهران', '1234567890', 'TRK17567067071233', '2', 'cod', 'USDT', 'توضیح خوبه'),
(4, 32, 'test1', '2025-09-01 10:55:38', '2025-09-01 07:25:38', '2025-09-01 10:42:18', '09121112345', 'اصفهان نصف جهان', 'اصفهان', 'اصفهان', '2345678923', '', '4', 'online', 'USDT', ''),
(5, 33, 'ali', '2025-09-01 11:47:21', '2025-09-01 08:17:21', '2025-09-01 10:49:09', '09148765432', 'تبریز خیابان اصلی جنب پمپ بنزین', 'آذربایجان شرقی', 'تبریز', '5432656432', '', '1', 'cod', 'USDT', 'تازه باشد');

-- --------------------------------------------------------

--
-- Table structure for table `order_items`
--

CREATE TABLE `order_items` (
  `id` int NOT NULL,
  `order_id` int NOT NULL,
  `product_id` int NOT NULL,
  `quantity` int NOT NULL,
  `price` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `order_items`
--

INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `quantity`, `price`) VALUES
(1, 3, 4, 1, 450000),
(2, 3, 5, 1, 3300000),
(3, 3, 6, 2, 140000),
(4, 3, 15, 2, 5500000),
(5, 4, 1, 1, 250000),
(7, 5, 17, 2, 1510000),
(8, 5, 15, 1, 5500000),
(9, 4, 15, 1, 5500000);

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int NOT NULL COMMENT 'کد کالا',
  `product_code` varchar(20) COLLATE utf8mb4_persian_ci NOT NULL COMMENT 'کد کالا',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_persian_ci NOT NULL COMMENT 'نام کالا',
  `qty` smallint NOT NULL COMMENT 'موجودی کالا',
  `price` float NOT NULL COMMENT 'قیمت کالا',
  `image` varchar(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_persian_ci NOT NULL COMMENT 'عکس کالا',
  `details` mediumtext COLLATE utf8mb4_persian_ci NOT NULL COMMENT 'توضیحات کالا'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci COMMENT='جدول کالاها';

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `product_code`, `name`, `qty`, `price`, `image`, `details`) VALUES
(1, '0', 'جعبه معمولی خاتم', 0, 250000, 'hoghe-choobi.jpg', 'ارتفاع	\r\n\r\n4 سانتی متر\r\nبرند	\r\n\r\nسلام\r\nبسته بندی	\r\n\r\nندارد\r\nجنس	\r\n\r\nخاتمکاری\r\nشهر سازنده	\r\n\r\nاصفهان\r\nصاحب اثر	\r\n\r\nخادم\r\nسادات\r\nطول	\r\n\r\n20 سانتی متر\r\nعرض	\r\n\r\n10 سانتی متر\r\nقابلیت شستشو	\r\n\r\nدستمال کشی خشک\r\nنوع کاربرد	\r\n\r\nجای جواهرات\r\nهنر	\r\n\r\nخاتم'),
(2, '0', 'جا دستمال کاغذی بغل کاس نقاشی', 3, 1650000, 'hoghe-jukkari.jpg', 'ارتفاع	\r\n\r\n8 سانتی متر\r\nبرند	\r\n\r\nسلام\r\nبسته بندی	\r\n\r\nندارد\r\nجنس	\r\n\r\nخاتمکاری\r\nشکل	\r\n\r\nمستطیل\r\nشهر سازنده	\r\n\r\nاصفهان\r\nصاحب اثر	\r\n\r\nخادم\r\nخراطی\r\nطول	\r\n\r\n25 سانتی متر\r\nعرض	\r\n\r\n13/5 سانتی متر\r\nقابلیت شستشو	\r\n\r\nدستمال کشی خشک\r\nنوع کاربرد	\r\n\r\nجا دستمال کاغذی\r\nهنر	\r\n\r\nخاتم\r\nنقاشی'),
(3, '0', 'شکلاتی سه درب داخل راش کوچک', 5, 450000, 'hoghe-khatamkari.jpg', '360 گرم وزن\r\nقطر تقریبی کلی 16 سانتیمتر\r\nچوب تزئین شده با هنر خاتم\r\nجنس داخلی: چوب راش\r\nمحل تولید: اصفهان\r\nکاربرد: مصرفی، تزئینی\r\nدارای پایه چوبی\r\nدارای درپوش\r\nکیفیت تضمین شده با قیمت مناسب\r\nانتخابی عالی برای هدیه به عزیزانتان'),
(4, '0', 'سبد حصیری', 2, 450000, 'kapoo.jpg', 'این سبد بسیار مفید است'),
(5, '0', 'شیرینی خوری فیروزه کوبی', 1, 3300000, 'kase-ghalamzani.jpg', '4 لایه پلی استر (لایه محافظ)\r\nدکوراتیو و قابل استفاده\r\n5 مدل متفاوت در طرح و ابعاد\r\nدارای 2 طرح شبکه بری و ساده\r\nداخل شیرینی خوری دارای قلمزنی می باشد'),
(6, '0', 'کاسه سنتی', 3, 140000, 'kase-sonati.jpg', 'کاسه های سنتی. برای عزیزانی که هنر و فرهنگ ایرانی برایشان ارزشمند است. این کاسه ها نتیجه ساعتها زحمت است.  مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی  پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم…'),
(7, '0', 'کاشی کاری هفت رنگ', 13, 17000, 'kashi-haft-rang.jpg', 'این کاشی ها میتوانند المان بجایی برای طراحی خانه‌تان باشند. این کاشی ها حاوی طرح و رنگ های اصیل ایرانی هستند.  مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی  پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم…'),
(9, '0', 'کوزه سفالی (خاک سفید)', 15, 120000, 'kooze-sofali-khaksefid.jpg', 'کوزه های دستی سفالی خاک سفید که ممکن است تاحالا هزاران بار دیده باشید.  مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی  پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم…'),
(10, '0', 'مجموعه چرمی دستی', 2, 890000, 'majmoe-charmi.jpg', 'مجموعه چرمی شامل کمربند، کیف و تعدادی قطعات چرمی دیگر. تهیه شده از چرم کاملا طبیعی و با شیوه های سنتی.  مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی  پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم…'),
(11, '0', 'مجموعه کوزه سفالی', 4, 1950000, 'majmoe-kooze-sofali.jpg', 'مجموعه کوزه های سفالی، مناسب برای طراحی داخلی مکان های مختلف.  مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی  پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم…'),
(12, '0', 'مجموعه ظروف مسی', 3, 560000, 'majmoe-zoroof-mesi.jpg', 'توضیحات: مجموعه طروف مسی اصیل اسرانی با لایه روکش قلع برای سلامتی شما جهت جلوگیری از مسمومیت با مس. مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم… '),
(13, '0', 'پارچه قلمکاری شده', 8, 4500000, 'parche-ghalamkari.jpg', 'توضیحات: پارچه های قلمکاری شده. از زیباترین محصولات صنایع دستی ایرانی هستند و طرفدار های زیادی در داخل و خارج از ایران دارند. مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم… '),
(14, '0', 'نمد بافته شده', 7, 660000, 'parche-namad-bafi.jpg', 'توضیحات: نمد بافته شده. وقتی ثروت‌ های بزرگ به دست برخی مردم می‌افتد در پرتو آن نیرومند می‌شوند و در سایهٔ نیرومندی و ثروت خیال می‌ کنند که می‌توانند در خارج از وطن خود زندگی نمایند و خوشبخت و سرافراز باشند ولی به زودی می‌ فهمند که اشتباه کرده‌ اند و عظمت هر ملتی بر روی خرابه‌ های وطن خودش می‌باشد و بس! '),
(15, '0', 'پارچه سوزن دوزی', 1, 5500000, 'parche-soozandozi.jpg', 'توضیحات: سوزن دوزی از مهم ترین و زیباترین صنایع دستی ایرانی است. وقتی ثروت‌ های بزرگ به دست برخی مردم می‌افتد در پرتو آن نیرومند می‌شوند و در سایهٔ نیرومندی و ثروت خیال می‌ کنند که می‌توانند در خارج از وطن خود زندگی نمایند و خوشبخت و سرافراز باشند ولی به زودی می‌ فهمند که اشتباه کرده‌ اند و عظمت هر ملتی بر روی خرابه‌ های وطن خودش می‌باشد و بس! '),
(17, '0', 'ظرف فیروزه کوبی شده', 0, 1510000, 'zarf-firozekoobi.jpg', 'توضیحات: اگر دنبال المان خاصی برای دکور یا طراحی داخلی خانه‌تان هستید، این محصول میتواند بخوبی برای شما این کار را انجام دهد. خالد حسینی تو رمان باد بادک باز مینویسه : ﻣﺮﺩ ﺁﻫﺴﺘﻪ ﺩﺭ ﮔﻮﺵ ﻓﺮﺯﻧﺪ ﺗﺎﺯﻩ ﺑﻪ ﺑ� ﻮﻍ ﺭﺳﯿﺪﻩ ﺍﺵ ﺑﺮﺍﯼ ﭘﻨﺪ ﭼﻨﯿﻦ ﻧ� ﻮﺍ ﮐﺮﺩ : ” ﭘﺴﺮﻡ ﺩﺭ ﺯﻧﺪﮔﯽ ﻫﺮﮔﺰ ﺩﺯﺩﯼ ﻧﮑﻦ ” ﭘﺴﺮ ﻣﺘﻌ� ﺐ ﻭ ﻣﺒﻬﻮﺕ ﺑﻪ ﭘﺪﺭ ﻧﮕﺎﻩ ﮐﺮﺩ ﺑﺪﯾﻦ ﻣﻌﻨﺎ ﮐﻪ ﺍﻭ ﻫﺮﮔﺰ ﺩﺳﺖ ﮐﺞ ﻧﺪﺍﺷﺘﻪ ﭘﺪﺭ ﺑﻪ ﻧﮕﺎﻩ ﻣﺘﻌ� ﺐ ﻓﺮﺯﻧﺪ ﻟﺒﺨﻨﺪﯼ ﺯﺩ ﻭ ﺍﺩﺍﻣﻪ ﺩﺍﺩ : ﺩﺭ ﺯﻧﺪﮔﯽ ﺩﺭﻭﻍ ﻧﮕﻮ ﭼﺮﺍ ﮐﻪ ﺍﮔﺮ ﮔﻔﺘﯽ ﺻﺪﺍﻗﺖ ﺭﺍ ﺩﺯﺩﯾﺪﻩ ﺍﯼ، ﺧﯿﺎﻧﺖ ﻧﮑﻦ ﮐﻪ ﺍﮔﺮ ﮐﺮﺩﯼ ﻋﺸﻖ ﺭﺍ ﺩﺯﺩﯾﺪﻩ ﺍﯼ، ﺧﺸﻮﻧﺖ ﻧﮑﻦ ﺍﮔﺮ ﮐﺮﺩﯼ ﻣﺤﺒﺖ ﺭﺍ ﺩﺯﺩﯾﺪﻩ ﺍﯼ، ﻧﺎ ﺣﻖ ﻧﮕﻮ ﺍﮔﺮ ﮔﻔﺘﯽ ﺣﻖ ﺭﺍ ﺩﺯﺩﯾﺪﻩ ﺍﯼ، ﺑﯽ ﺣﯿﺎﯾﯽ ﻧﮑﻦ ﺍﮔﺮ ﮐﺮﺩﯼ ﺷﺮﺍﻓﺖ ﺭﺍ ﺩﺯﺩﯾﺪﻩ ﺍی... ﭘﺲ ﺩﺭ ﺯﻧﺪﮔﯽ ﻓﻘﻂ ﺩﺯﺩﯼ نکن ! '),
(18, '0', 'فرش دستباف اصفهان', 1, 160000000, 'farsh-tabrizi.jpg', 'فرش اصفهان فرشی تربیت شده و برخوردار از ظرافت و زیبایی و یادگاری از فرشهای پر شکوه دوران صفوی است. نقوش این فرشها با قلم هنرمندانی چون کمال الدین بهزاد است که به طرحی برای فرش تبدیل می‌شود. هماهنگی، تناسب و تنوع رنگ به خصوص رنگهای شاد در طیفهای تیره و روشن، پرزهای کوتاه، رجشمار بین ۵۰ تا ۹۰، استفاده از گره فارسی، شیرازه متصل و اغلب دو پوده و لول و همچنین پرداخت در موقع بافت از ویژگی‌های قالیبافی اصفهان است.'),
(23, '654', 'پارچه سرمه‌دوزی شده', 0, 1555000, '68b0541a8097d_1-2.jpg', 'سرمه‌دوزی یک هنر منحصربه‌فرد و ارزشمند ایرانی است که از گذشته روی انواع پارچه اجرا می‌شود.\r\n\r\n    استفاده از نخ‌های فلزی: یکی از ویژگی‌های بارز سرمه‌دوزی، استفاده از نخ‌های نقره‌ای، طلایی و گاه برنجی است. این نخ‌ها به پارچه جلوه‌ای براق و چشم‌نواز می‌بخشند که درخشش آن‌ها زیر نور بسیار جذاب است.\r\n\r\n    طرح‌های پیچیده و متنوع: در سرمه‌دوزی، طرح‌ها معمولا شامل نقوش اسلیمی، گل و بوته، بته‌جقه و حتی آیات و عبارات مذهبی هستند. این طرح‌ها به‌صورت دستی و با دقت بالا روی پارچه اجرا می‌شوند که نیازمند مهارت و تجربه بسیار است.\r\n    ابعاد سه‌بعدی: سرمه‌دوزی به دلیل برجسته بودن نخ‌ها و استفاده از تزئینات مختلف مانند مهره‌ها و ملیله‌ها، جلوه‌ای سه‌بعدی دارد. این ویژگی باعث می‌شود که طرح‌ها از سطح پارچه بیرون زده و جلوه‌ای زنده و پویاتر داشته باشند.\r\n    کاربرد در محصولات لوکس و تزئینی: سرمه‌دوزی عمدتا در ساخت و تزئین محصولات لوکس مانند لباس‌های مجلسی، پرده‌ها، جانمازها و رومیزی‌های تزئینی به کار می‌رود. این ویژگی باعث می‌شود سرمه‌دوزی معمولاً به‌عنوان هنری فاخر و گران‌قیمت شناخته شود.'),
(24, '345', 'تسبفقثثی', 3, 333333, '68b3ec2f50be5_medical-visa.jpg', 'تستستستستس'),
(25, 'A34234', 'سیبسبسیب', 133, 33333, '68b3ef7dbffca_medical-visa.jpg', 'سیبسبسیب');

-- --------------------------------------------------------

--
-- Table structure for table `provinces`
--

CREATE TABLE `provinces` (
  `id` int NOT NULL,
  `name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`id`, `name`) VALUES
(1, 'اردبیل'),
(2, 'اصفهان'),
(3, 'البرز'),
(4, 'ایلام'),
(5, 'آذربایجان شرقی'),
(6, 'آذربایجان غربی'),
(7, 'بوشهر'),
(8, 'تهران'),
(9, 'چهارمحال وبختیاری'),
(10, 'خراسان جنوبی'),
(11, 'خراسان رضوی'),
(12, 'خراسان شمالی'),
(13, 'خوزستان'),
(14, 'زنجان'),
(15, 'سمنان'),
(16, 'سیستان وبلوچستان'),
(17, 'فارس'),
(18, 'قزوین'),
(19, 'قم'),
(20, 'کردستان'),
(21, 'کرمان'),
(22, 'کرمانشاه'),
(23, 'کهگیلویه وبویراحمد'),
(24, 'گلستان'),
(25, 'گیلان'),
(26, 'لرستان'),
(27, 'مازندران'),
(28, 'مرکزی'),
(29, 'هرمزگان'),
(30, 'همدان'),
(31, 'یزد');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `username` varchar(50) COLLATE utf8mb4_persian_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_persian_ci NOT NULL,
  `realname` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `email` varchar(100) COLLATE utf8mb4_persian_ci DEFAULT NULL,
  `user_type` tinyint(1) DEFAULT '0',
  `is_active` tinyint(1) DEFAULT '1',
  `login_attempts` int DEFAULT '0',
  `last_login_attempt` datetime DEFAULT NULL,
  `last_login` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deactivated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `realname`, `email`, `user_type`, `is_active`, `login_attempts`, `last_login_attempt`, `last_login`, `created_at`, `updated_at`, `deactivated_at`) VALUES
(22, 'admin', '$2y$10$FrN0suuUDPt0kytI394G6O4aR/GHeWjpVgAJQAniGiZTf1gyFfpe6', 'مدیریت', 'admin@iranianshop.ir', 1, 1, 0, NULL, NULL, '2025-08-26 12:36:00', '2025-09-02 19:04:01', NULL),
(25, 'ehsan1', '$2y$10$Wsaa2OrxoyorznGmkLwYTen2FJcA48lWSEOEB/y26nkBidj/ENSA2', 'تست عضو2', 'w@4.com', 0, 1, 0, '2025-09-01 06:04:42', '2025-09-02 19:02:06', '2025-08-26 12:36:00', '2025-09-02 19:02:06', '2025-08-28 13:05:44'),
(26, 'ehsan', '$2y$10$Wsaa2OrxoyorznGmkLwYTen2FJcA48lWSEOEB/y26nkBidj/ENSA2', 'احسان ثروتمند', 'ehsan@ymail.com', 1, 1, 0, '2025-08-31 12:47:52', '2025-09-02 19:02:21', '2025-08-26 12:36:00', '2025-09-02 19:02:21', NULL),
(30, 'user1', '$2y$10$UjSNkO3Czj.9zXQoqn3VBekDsPsNSothr9LOy5febbChreY1V9Pj2', 'تست عضو', 'user@gg.com', 0, 1, 0, NULL, '2025-08-31 14:52:51', '2025-08-31 14:52:51', '2025-08-31 14:52:51', NULL),
(31, 'test', '$2y$10$EMSIlYxtqxCjA2FMplwDBOGbDkkd2TESWPtxv.OpmyLXoXoU5jn1W', 'تست عضو', 'test@g.com', 1, 0, 0, '2025-09-01 11:48:41', '2025-09-01 11:48:48', '2025-08-31 15:01:40', '2025-09-02 19:02:49', '2025-09-02 19:02:49'),
(32, 'test1', '$2y$10$n1nnixmp5USEx4cfP0xhn.QjK/Kx/E.Wa03rFr7NNwkvE9zDrT9LK', 'عضو جد', 'test1@jg.com', 0, 1, 0, '2025-08-31 15:58:09', '2025-09-01 10:54:00', '2025-08-31 15:18:32', '2025-09-01 10:54:00', NULL),
(33, 'ali', '$2y$10$aeAbWqSd6OFk5kWEQCERZuQ1Fv/zQVTVHX.ZBAsYlWkzKQNgE14Q2', 'علی صداقت', 'ali@g.com', 0, 1, 0, NULL, '2025-09-01 11:27:10', '2025-09-01 11:27:10', '2025-09-01 11:27:10', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `user_tokens`
--

CREATE TABLE `user_tokens` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `token` varchar(64) COLLATE utf8mb3_persian_ci NOT NULL,
  `expiry` datetime NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `wishlist`
--

CREATE TABLE `wishlist` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `wishlist`
--

INSERT INTO `wishlist` (`id`, `user_id`, `product_id`, `created_at`) VALUES
(1, 25, 15, '2025-09-01 03:26:58'),
(2, 25, 18, '2025-09-01 03:27:20'),
(3, 25, 17, '2025-09-01 03:36:53'),
(6, 25, 6, '2025-09-01 04:18:29'),
(7, 25, 7, '2025-09-01 04:45:24'),
(8, 31, 6, '2025-09-01 09:18:58');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cart`
--
ALTER TABLE `cart`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_product` (`user_id`,`product_id`),
  ADD KEY `product_id` (`product_id`);

--
-- Indexes for table `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`),
  ADD KEY `province_id` (`province_id`);

--
-- Indexes for table `login_logs`
--
ALTER TABLE `login_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_id` (`order_id`),
  ADD KEY `product_id` (`product_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_qty` (`qty`),
  ADD KEY `idx_price` (`price`);

--
-- Indexes for table `provinces`
--
ALTER TABLE `provinces`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Indexes for table `user_tokens`
--
ALTER TABLE `user_tokens`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `wishlist`
--
ALTER TABLE `wishlist`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_product` (`user_id`,`product_id`),
  ADD KEY `product_id` (`product_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `cart`
--
ALTER TABLE `cart`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1133;

--
-- AUTO_INCREMENT for table `login_logs`
--
ALTER TABLE `login_logs`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'کد پیام', AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'شماره سفارش', AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int NOT NULL AUTO_INCREMENT COMMENT 'کد کالا', AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT for table `provinces`
--
ALTER TABLE `provinces`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT for table `user_tokens`
--
ALTER TABLE `user_tokens`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `wishlist`
--
ALTER TABLE `wishlist`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `cart`
--
ALTER TABLE `cart`
  ADD CONSTRAINT `cart_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `cart_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `login_logs`
--
ALTER TABLE `login_logs`
  ADD CONSTRAINT `login_logs_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `order_items`
--
ALTER TABLE `order_items`
  ADD CONSTRAINT `order_items_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `order_items_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `user_tokens`
--
ALTER TABLE `user_tokens`
  ADD CONSTRAINT `user_tokens_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `wishlist`
--
ALTER TABLE `wishlist`
  ADD CONSTRAINT `wishlist_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `wishlist_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
